README.md

# Table des matières

1.  [Contexte](#org80f3125)
2.  [Installation](#org40c3e23)
3.  [Utilisation](#org37a501b)
4.  [Menu](#org30ac5f6)
    1.  [Lister les fichiers](#orgb0e2b7e)
    2.  [Ajouter un fichier](#org56234ce)
    3.  [Supprimer un fichier](#org36b40a2)
    4.  [Afficher des informations sur un livre](#orgd27dca5)



<a id="org80f3125"></a>

# Contexte

  Le programme doit permettre de travailler sur un ensemble de fichiers
texte correspondant à des livres.


<a id="org40c3e23"></a>

# Installation

Faire un git clone du projet <https://github.com/jm-devweb/java-project-books.git>

L'archive est dans le répertoire ./out


<a id="org37a501b"></a>

# Utilisation

Lancer la commande java -jar java-project-books.jar [FILE]


<a id="org30ac5f6"></a>

# Menu


<a id="orgb0e2b7e"></a>

## Lister les fichiers

Liste des fichiers référencés.


<a id="org56234ce"></a>

## Ajouter un fichier

Ajoute des fichiers dans la liste de référence soit :

<div class="VERBATIM">
1.  Le chemin du fichier

2.  Un répertoire contenant les fichiers, seul les fichiers .txt sont pris en compte

</div>


<a id="org36b40a2"></a>

## Supprimer un fichier

Permet de supprimer un fichier référencé.


<a id="orgd27dca5"></a>

## Afficher des informations sur un livre

Afficher le nombre de lignes du fichier

Afficher le nombre de mots du fichier

<div class="VERBATIM">
1.  Le nombre de mot dans le fichier

2.  Le top 50 des mots du texte

</div>

